---
kind: property
id: P:Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Location
source: html/3fcaf146-8612-2046-e6f1-7fff92f4246b.htm
---
# Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Location Property

Full path of the central model which is to be operated.

## Syntax (C#)
```csharp
public string Location { get; }
```

## Remarks
For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.